//---------------------------------------------------------------------------

#ifndef integrationH
#define integrationH
//---------------------------------------------------------------------------
namespace chi {
class integration{

public:
	/* [СТАНДАРТНЫЕ МЕТОДЫ] */

	/*запись НУ*/
	void set_NU(double r[3], double v[3], double t);
	void set_NU(double rv[6],  double t);

//private:
protected:
	/*начальные условия интегрирования*/
	double r_nu[3];	//начальный радиус-вектор [км]
	double v_nu[3];	//начальный вектор скорости [км/с]
	double t_nu;	//начальный момент времени в формате юлианской даты (UTC)

	/*настройки численного интегрирования*/


	/**/



	/* [ПРИВАТНЫЕ МЕТОДЫ] */






};



};




#endif
